<?

class PropisDrob2{
	
	function propis($rub){
$dop0 = Array("тыс€чных","тыс€ч","миллионов","миллиардов");
$dop1 = Array("тыс€чна€","тыс€ча","миллион","миллиард");
$dop2 = Array("тыс€чных","тыс€чи","миллиона","миллиарда");
$s1 = Array("","одна","две","три","четыре","п€ть","шесть","семь","восемь","дев€ть");
$s11 = Array("","одна","две","три","четыре","п€ть","шесть","семь","восемь","дев€ть");
$s2 = Array("","дес€ть","двадцать","тридцать","сорок","п€тьдес€т","шестьдес€т","семьдес€т","восемьдес€т","дев€носто");
$s22 = Array("дес€ть","одиннадцать","двенадцать","тринадцать","четырнадцать","п€тнадцать","шестнадцать","семнадцать","восемнадцать","дев€тнадцать");
$s3 = Array("","сто","двести","триста","четыреста");

if($rub==0)
{// если это 0
return "ноль ".$dop0[0];
}

// разбиваем полученное число на тройки и загон€ем в массив $triplet
$t_count = ceil(strlen($rub)/3);
for($i=0;$i<$t_count;$i++)
{
$k = $t_count - $i - 1;
$triplet[$k] = $rub%1000;
$rub = floor($rub/1000);
}

// пробегаем по триплетам
for($i=0;$i<$t_count;$i++)
{
$t = $triplet[$i]; // это текущий триплет - с ним и работаем
$k = $t_count - $i - 1;
$n1 = floor($t/100);
$n2 = floor(($t-$n1*100)/10);
$n3 = $t-$n1*100-$n2*10;

// обрабатываем сотни
if($n1<5) $res .= $s3[$n1]." ";
elseif($n1) $res .= $s1[$n1]."сот ";

if($n2>1)
{// второй дес€ток
$res .= $s2[$n2]." ";
if($n3 and $k==1)
{// если есть единицы в триплете и это триплет “џ—я„
$res .= $s11[$n3]." ";
}
elseif($n3)
{
$res .= $s1[$n3]." ";
}
}
elseif($n2==1)
{
$res .= $s22[$n3]." ";
}
elseif($n3 and $k==1)
{// если есть единицы в триплете и это триплет “џ—я„
$res .= $s11[$n3]." ";
}
elseif($n3)
{
$res .= $s1[$n3]." ";
}

// прилепл€ем в конец триплета коммент
if($n3==1 and $n2!=1)
{// в конце триплета стоит 1, но не 11.
$res .= $dop1[$k]." ";
}
elseif($n3>1 and $n3<5 and $n2!=1)
{// в конце триплета стоит 2, 3 или 4, но не 12, 13 или 14
$res .= $dop2[$k]." ";
}
elseif($t or $k==0)
{
$res .= $dop0[$k]." ";
}
}
return $res;
} 
	
	
	
}

?>